package org.example.lesson_4

const val WEIGHT_MIN = 35
const val WEIGHT_MAX = 100
const val VOLUME_MAX = 99
fun main() {
    /*
        При работе на таможенном терминале важно точно определить категорию каждого груза.
        Напиши программу, которая проверяет, соответствует ли груз категории "Average".
        Эта категория имеет следующие параметры: вес от 35 кг до 100 кг (включительно), и объем меньше 100 литров.

    Создай программу, которая отображает соответствие данных груза категории "Average".
    Вывод программы может выглядеть так: "Груз с весом 42 кг и объемом 120 л соответствует категории 'Average': false".

    - укажи предварительно заданные параметры категории;
    - проверь, соответствуют ли следующие грузы категории "Average": 20 кг / 80 л и 50 кг / 100 л;
    - сделай сравнение непосредственно внутри println() и без использования диапазонов.
     */
    var weight = 20
    var volume = 80
    println(
        "Груз с весом $weight кг и $volume л соответствует категории 'Average': " +
                "${weight >= WEIGHT_MIN && weight <= WEIGHT_MAX && volume <= VOLUME_MAX}"
    )

    weight = 50
    volume = 100
    println(
        "Груз с весом $weight кг и $volume л соответствует категории 'Average': " +
                "${weight >= WEIGHT_MIN && weight <= WEIGHT_MAX && volume <= VOLUME_MAX}"
    )
}